In [8]:
import pandas as pd
df = pd.read_csv("Salary Data.csv")
df

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,NaN
...,...,...,...,...,...,...
370,35.0,Female,Bachelor's,Senior Marketing Analyst,8.0,85000.0
371,43.0,Male,Master's,Director of Operations,19.0,170000.0
372,29.0,Female,Bachelor's,Junior Project Manager,2.0,40000.0
373,34.0,Male,Bachelor's,Senior Operations Coordinator,7.0,90000.0
374,44.0,Female,PhD,Senior Business Analyst,15.0,150000.0

In [9]:
df.isna().sum()

Age                    3
Gender                 2
Education Level        2
Job Title              2
Years of Experience    4
Salary                 5
dtype: int64

In [10]:
df["Age"] = df["Age"].fillna(df["Age"].median())

In [11]:
df["Age"].isnull().sum()

np.int64(0)

In [12]:
df["Years of Experience"] = df["Years of Experience"].fillna(df["Years of Experience"].mean())

In [13]:
df["Years of Experience"].isnull().sum()

np.int64(0)

In [14]:
df = df.dropna(subset=["Salary"])

In [15]:
df.isna().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [16]:
df.to_csv("Salary_Data_Cleaned.csv", index=False)